## Working on Series and Dataframe

In [10]:
import numpy as np
import pandas as pd

In [20]:
ser = pd.Series(np.random.rand(34))
# This will create a series with 34 random numbers.

In [21]:
ser

0     0.029866
1     0.414264
2     0.959634
3     0.129761
4     0.495018
5     0.377554
6     0.676020
7     0.737660
8     0.757727
9     0.218268
10    0.144380
11    0.660496
12    0.412496
13    0.461382
14    0.241363
15    0.761215
16    0.124896
17    0.588895
18    0.973888
19    0.575058
20    0.668840
21    0.102488
22    0.786110
23    0.091765
24    0.863563
25    0.611955
26    0.096937
27    0.224040
28    0.961797
29    0.995670
30    0.260983
31    0.027580
32    0.989977
33    0.011224
dtype: float64

In [12]:
type(ser)

pandas.core.series.Series

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))
# This will create a dataframe with 334 rows and 5 columns and index will be from 0 to 333.

In [ ]:
newdf.head() # This will print the first 5 rows of the dataframe.

          0         1         2         3         4
0  0.137323  0.475516  0.371253  0.283712  0.168428
1  0.268339  0.422132  0.545806  0.176248  0.032686
2  0.526331  0.249862  0.226285  0.131115  0.511602
3  0.448762  0.641428  0.722056  0.746669  0.284548
4  0.261855  0.023933  0.024279  0.642246  0.828274

In [18]:
type(newdf)

pandas.core.frame.DataFrame

In [49]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf2 = pd.DataFrame(np.random.rand(334, 5), index=np.arange(1, 335))
# This will create a dataframe with 334 rows and 5 columns and index will be from 1 to 334.

In [31]:
newdf2

            0         1         2         3         4
1    0.419985  0.002078  0.526023  0.067293  0.282587
2    0.301661  0.302760  0.725586  0.902928  0.298952
3    0.331726  0.140995  0.146907  0.530314  0.108364
4    0.457623  0.468116  0.134253  0.504068  0.341385
5    0.913611  0.682397  0.046800  0.966280  0.385617
..        ...       ...       ...       ...       ...
330  0.758697  0.120615  0.406587  0.156062  0.310773
331  0.416678  0.608368  0.383899  0.656473  0.300871
332  0.709161  0.223908  0.966743  0.116312  0.264950
333  0.244873  0.687361  0.632464  0.017844  0.475147
334  0.570520  0.948800  0.604517  0.670725  0.016033

[334 rows x 5 columns]

In [ ]:
newdf2.to_csv('newdf2.csv', index=False)
# This will save the dataframe to a csv file.

In [ ]:
newdf.describe() # This will give the statistical data of the dataframe.

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.512441    0.491266    0.482203    0.502477    0.499502
std      0.284348    0.277782    0.293353    0.285079    0.294688
min      0.002199    0.001718    0.000088    0.000516    0.002209
25%      0.271946    0.267969    0.216983    0.267458    0.232043
50%      0.524865    0.474481    0.492761    0.499928    0.513016
75%      0.760821    0.702188    0.718442    0.757325    0.756115
max      0.998396    0.996121    0.996837    0.999195    0.999457

In [ ]:
newdf.dtypes # This will give the data types of the columns of the dataframe.

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
newdf2[0][0] = "Gaurav"
# This will change the value of the first row and first column to "Gaurav".

In [40]:
newdf

            0         1         2         3         4
0      Gaurav  0.475516  0.371253  0.283712  0.168428
1    0.268339  0.422132  0.545806  0.176248  0.032686
2    0.526331  0.249862  0.226285  0.131115  0.511602
3    0.448762  0.641428  0.722056  0.746669  0.284548
4    0.261855  0.023933  0.024279  0.642246  0.828274
..        ...       ...       ...       ...       ...
329  0.897198  0.966883  0.088054  0.986826  0.696111
330  0.078474  0.319699  0.713978  0.324181  0.234071
331  0.134511  0.512529  0.006768  0.090818  0.646690
332  0.293212  0.854205  0.637883  0.931690  0.389261
333  0.429715  0.932833  0.582405  0.373915  0.443563

[334 rows x 5 columns]

In [45]:
newdf2.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

### Printing the index of data frame

In [46]:
newdf2.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334],
      dtype='int64', length=334)

In [48]:
newdf2.columns

RangeIndex(start=0, stop=5, step=1)

### To convert Pandas Series or Dataframe into numpy array

In [ ]:
newdf2.to_numpy()
# This will convert the dataframe to a numpy array.

array([[0.41998511, 0.0020783 , 0.52602313, 0.06729269, 0.28258669],
       [0.30166117, 0.30276025, 0.72558648, 0.90292801, 0.29895175],
       [0.33172626, 0.14099516, 0.14690671, 0.53031352, 0.10836383],
       ...,
       [0.70916124, 0.22390807, 0.96674311, 0.11631157, 0.26494966],
       [0.24487334, 0.6873613 , 0.63246354, 0.01784406, 0.47514711],
       [0.57051964, 0.94879992, 0.6045167 , 0.67072508, 0.0160327 ]])

### To sort (in descending order)

In [55]:
newdf2.sort_index(axis=0, ascending=False)
# This will sort the dataframe in descending order.

            0         1         2         3         4
334  0.570520  0.948800  0.604517  0.670725  0.016033
333  0.244873  0.687361  0.632464  0.017844  0.475147
332  0.709161  0.223908  0.966743  0.116312  0.264950
331  0.416678  0.608368  0.383899  0.656473  0.300871
330  0.758697  0.120615  0.406587  0.156062  0.310773
..        ...       ...       ...       ...       ...
5    0.913611  0.682397  0.046800  0.966280  0.385617
4    0.457623  0.468116  0.134253  0.504068  0.341385
3    0.331726  0.140995  0.146907  0.530314  0.108364
2    0.301661  0.302760  0.725586  0.902928  0.298952
1    0.419985  0.002078  0.526023  0.067293  0.282587

[334 rows x 5 columns]